dic = {}
print(dic)


dic  = {'이름':'김다은','나이':12,'성별':'여성','생일':'6월26일'}
print(dic )

ice = {'메로나':1000,'비비빅':1200,'빵빠레':1800}
print(ice)

ice = {'메로나':1000,'비비빅':1200,'빵빠레':1800}
ice['죠스바'] = 1200
ice['월드콘'] =1500
print(ice)


ice = {'메로나':1000,
    '비비빅':1200,
    '빵빠레':1800,
    '죠스바':  1200,
    '월드콘': 1500}
print("메로나 가격: ", ice["메로나"])

ice = {'메로나':1000,
    '비비빅':1200,
    '빵빠레':1800,
    '죠스바':  1200,
    '월드콘': 1500}
ice["메로나"] =1300
print(ice)

ice = {'메로나':1000,
    '비비빅':1200,
    '빵빠레':1800,
    '죠스바':  1200,
    '월드콘': 1500}
del ice["메로나"]
print(ice)

ice = {'메로나':[1000,20],
       '비비빅':[1200,3],
       '죠스바': [1800,100]}
print(ice)  

ice = {'메로나':[1000,20],
       '비비빅':[1200,3],
       '죠스바': [1800,100]}
print(ice["메로나"][0],"원")
print(ice["메로나"][1],"개")

ice = {'메로나':[1000,20],
       '비비빅':[1200,3],
       '죠스바': [1800,100]}
ice["월드콘"] = [500,7]
print(ice)

print("휘뚜루 마뚜루 휘뚜루 마뚜루")

s1=set([1,2,3,4,5,6])
s2=set([4,5,6,7,8,9])
print(s1&s2)

s1=set([1,2,3,4,5,6])
s2=set([4,5,6,7,8,9])
print(s1|s2)

s1=set([1,2,3,4,5,6])
s2=set([4,5,6,7,8,9])
print(s1-s2)
print(s2-s1)

string ="안녕하세요"
for 변수 in string:
    print(변수)

list = ["리","스","트",1,2,3]
for 변수 in list:
    print(변수)

tuple=("튜","플",4,5,6)
for 변수 in tuple:
    print(변수)

for 변수 in [10,20,30]:
    print(변수)
